Attribute VB_Name = "adoxConnect"
'#################################################
'ADOX
'#################################################
Option Explicit

'==================================================
'ADOXのオブジェクトモデル
'==================================================
'押さえるべきオブジェクト
'Catalog／接続中のデータベースを表すオブジェクト
'Column／テーブル、インデックス、またはキーの列を表す
'Index／テーブルのインデックスを表す
'Key／テーブルのキーフィールドを表す
'Table／列、インデックス、及びキーを含むテーブルを表す
'User／保護されているデータベースへのアクセス権を持つユーザーアカウントを表す
'View／抽出されたレコードのセットまたは仮想テーブルを表す

'---------------------------------------------------
'ADOXができること
'---------------------------------------------------
'データベース、テーブル、クエリを新規に作成する
'既存のテーブルやクエリのオブジェクト構造を変更することができる。
    'ADOにはない機能。


